In [2]:
import pandas as pd
s = pd.Series([11,12,13,14,15,16])
s

0    11
1    12
2    13
3    14
4    15
5    16
dtype: int64

In [3]:
s[5] #single value access

16

In [4]:
s[[4,0,3,2,5]] #access multi value

4    15
0    11
3    14
2    13
5    16
dtype: int64

In [5]:
s[4] = 4455 #update values

In [6]:
s

0      11
1      12
2      13
3      14
4    4455
5      16
dtype: int64

In [7]:
s [[3,2]] = [444,666] #update multi values

In [8]:
s

0      11
1      12
2     666
3     444
4    4455
5      16
dtype: int64

In [9]:
del s[3] #delete

In [10]:
s

0      11
1      12
2     666
4    4455
5      16
dtype: int64

In [12]:
del [2,0] # cant delete multi values

SyntaxError: can't delete literal (<ipython-input-12-00504308c6fe>, line 1)

In [13]:
s[7] = [88888] #insert

In [14]:
s

0         11
1         12
2        666
4       4455
5         16
7    [88888]
dtype: object

In [15]:
s[8] = 8888
s

0         11
1         12
2        666
4       4455
5         16
7    [88888]
8       8888
dtype: object

In [16]:
s [[9,10]] = [9999,101010] # cant insert multi values

ValueError: [ 9 10] not contained in the index

In [17]:
# index work like here like a key in dictionery, where if you delete any index so it wont update the whole list.

In [18]:
#Defining our own index(label/Keys)
#you can pass strings as a index
s1 = pd.Series([100,200,300,400], index = ["apples", "oranges", "mangos", "bananas"])
s1

apples     100
oranges    200
mangos     300
bananas    400
dtype: int64

In [19]:
#If we make new index and pass them and new index have some new values so pandas shows that it dont have value(NaN) and the previous indexs have previous values

ourIndex = ["peaches","apples", "oranges", "mangos","kewies"]
s2 = pd.Series(s1, index=ourIndex)
s2

peaches      NaN
apples     100.0
oranges    200.0
mangos     300.0
kewies       NaN
dtype: float64

In [20]:
s2 > 100

peaches    False
apples     False
oranges     True
mangos      True
kewies     False
dtype: bool

In [21]:
s2[s2>100]

oranges    200.0
mangos     300.0
dtype: float64

In [22]:
"apples" in s2

True

In [23]:
s2["apples" in s2]

100.0

In [25]:
#creating a series using dictionary
sdata = {"oho" : 1000, "lol" : 2000, "king" : 3000, "jung" : 4000}
sdata

{'oho': 1000, 'lol': 2000, 'king': 3000, 'jung': 4000}

In [26]:
s3 = pd.Series(sdata)
s3

oho     1000
lol     2000
king    3000
jung    4000
dtype: int64

In [27]:
pd.isnull(s2)

peaches     True
apples     False
oranges    False
mangos     False
kewies      True
dtype: bool

In [28]:
pd.notnull(s2)

peaches    False
apples      True
oranges     True
mangos      True
kewies     False
dtype: bool

In [29]:
df = pd.DataFrame(["Red", "Green", "Blue"])
df

       0
0    Red
1  Green
2   Blue

In [37]:
df = pd.DataFrame(["Red", "Green", "Blue"], index = ["v1","v2","v3"], column = ["C1","C2"])
df

TypeError: __init__() got an unexpected keyword argument 'column'

In [41]:
#creating frames using dictionetry
scores = {"Ai for EO" : [90,67,34,56,78,89,67,23,17,23], "python1":[34,25,61,37,78,93,56,74,29,10], "Python2" : [12,56,78,34,56,12,34,42,56,78]}
data  = pd.DataFrame(scores)
data

   Ai for EO  python1  Python2
0         90       34       12
1         67       25       56
2         34       61       78
3         56       37       34
4         78       78       56
5         89       93       12
6         67       56       34
7         23       74       42
8         17       29       56
9         23       10       78

In [42]:
scores = {"Ai for EO" : [90,67,34,56,78,89,67,23,17,23], "python1":[34,25,61,37,78,93,56,74,29,10], "Python2" : [12,56,78,34,56,12,34,42,56,78]}
data  = pd.DataFrame(scores, index = ["Ali", "Ahmed", "Junaid", "Raza", "Asim", "Danish", "Hamza", "Saad", "Shameer", "Baqar"])
data

         Ai for EO  python1  Python2
Ali             90       34       12
Ahmed           67       25       56
Junaid          34       61       78
Raza            56       37       34
Asim            78       78       56
Danish          89       93       12
Hamza           67       56       34
Saad            23       74       42
Shameer         17       29       56
Baqar           23       10       78

In [43]:
data.python1

Ali        34
Ahmed      25
Junaid     61
Raza       37
Asim       78
Danish     93
Hamza      56
Saad       74
Shameer    29
Baqar      10
Name: python1, dtype: int64

In [44]:
data['python1']

Ali        34
Ahmed      25
Junaid     61
Raza       37
Asim       78
Danish     93
Hamza      56
Saad       74
Shameer    29
Baqar      10
Name: python1, dtype: int64

In [45]:
data["Ai for EO"]

Ali        90
Ahmed      67
Junaid     34
Raza       56
Asim       78
Danish     89
Hamza      67
Saad       23
Shameer    17
Baqar      23
Name: Ai for EO, dtype: int64

In [46]:
data["Baqar"]["python1"]

KeyError: 'Baqar'

In [47]:
#Exclusive values will be included
data.loc["Baqar"]

Ai for EO    23
python1      10
Python2      78
Name: Baqar, dtype: int64

In [48]:
#As you see Exclusive values are included
data.loc["Baqar"]["Ai for EO": "python1"]

Ai for EO    23
python1      10
Name: Baqar, dtype: int64

In [49]:
#iloc work for the index values although there is name of index but it also have some numeric index value as show below. It also includes exclusive value.
data.iloc[2]["Ai for EO"]

34

In [50]:
data.iloc[2]

Ai for EO    34
python1      61
Python2      78
Name: Junaid, dtype: int64

In [53]:
data.iloc[2]["Ai for EO":"Python2"]

Ai for EO    34
python1      61
Python2      78
Name: Junaid, dtype: int64

In [54]:
data.iloc[2][["Ai for EO","python1","Python2"]]

Ai for EO    34
python1      61
Python2      78
Name: Junaid, dtype: int64

In [55]:
data.loc["Ali":"Hamza"]

        Ai for EO  python1  Python2
Ali            90       34       12
Ahmed          67       25       56
Junaid         34       61       78
Raza           56       37       34
Asim           78       78       56
Danish         89       93       12
Hamza          67       56       34

In [56]:
data.loc["Ali":"Hamza"]["Ai for EO"]

Ali       90
Ahmed     67
Junaid    34
Raza      56
Asim      78
Danish    89
Hamza     67
Name: Ai for EO, dtype: int64

In [58]:
#iloc dont include raw when it comes to raws but includes colums when it comes to colums
data.iloc[0:6]

        Ai for EO  python1  Python2
Ali            90       34       12
Ahmed          67       25       56
Junaid         34       61       78
Raza           56       37       34
Asim           78       78       56
Danish         89       93       12

In [59]:
data.iloc[0:6]["python1"]

Ali       34
Ahmed     25
Junaid    61
Raza      37
Asim      78
Danish    93
Name: python1, dtype: int64

In [66]:
data ["Total"] = data["Ai for EO"] +data["python1"] +data["Python2"]
data

         Ai for EO  python1  Python2  Total
Ali             90       34       12    136
Ahmed           67       25       56    148
Junaid          34       61       78    173
Raza            56       37       34    127
Asim            78       78       56    212
Danish          89       93       12    194
Hamza           67       56       34    157
Saad            23       74       42    139
Shameer         17       29       56    102
Baqar           23       10       78    111

In [70]:
data ["Avarage"] = data["Ai for EO"] + data["python1"] + data["Python2"] / 3
data

         Ai for EO  python1  Python2  Total     Avarage
Ali             90       34       12    136  128.000000
Ahmed           67       25       56    148  110.666667
Junaid          34       61       78    173  121.000000
Raza            56       37       34    127  104.333333
Asim            78       78       56    212  174.666667
Danish          89       93       12    194  186.000000
Hamza           67       56       34    157  134.333333
Saad            23       74       42    139  111.000000
Shameer         17       29       56    102   64.666667
Baqar           23       10       78    111   59.000000

In [71]:
data.info

<bound method DataFrame.info of          Ai for EO  python1  Python2  Total     Avarage
Ali             90       34       12    136  128.000000
Ahmed           67       25       56    148  110.666667
Junaid          34       61       78    173  121.000000
Raza            56       37       34    127  104.333333
Asim            78       78       56    212  174.666667
Danish          89       93       12    194  186.000000
Hamza           67       56       34    157  134.333333
Saad            23       74       42    139  111.000000
Shameer         17       29       56    102   64.666667
Baqar           23       10       78    111   59.000000>

In [72]:
data.columns

Index(['Ai for EO', 'python1', 'Python2', 'Total', 'Avarage'], dtype='object')

In [73]:
data.values

array([[ 90.        ,  34.        ,  12.        , 136.        ,
        128.        ],
       [ 67.        ,  25.        ,  56.        , 148.        ,
        110.66666667],
       [ 34.        ,  61.        ,  78.        , 173.        ,
        121.        ],
       [ 56.        ,  37.        ,  34.        , 127.        ,
        104.33333333],
       [ 78.        ,  78.        ,  56.        , 212.        ,
        174.66666667],
       [ 89.        ,  93.        ,  12.        , 194.        ,
        186.        ],
       [ 67.        ,  56.        ,  34.        , 157.        ,
        134.33333333],
       [ 23.        ,  74.        ,  42.        , 139.        ,
        111.        ],
       [ 17.        ,  29.        ,  56.        , 102.        ,
         64.66666667],
       [ 23.        ,  10.        ,  78.        , 111.        ,
         59.        ]])

In [74]:
data.describe

<bound method NDFrame.describe of          Ai for EO  python1  Python2  Total     Avarage
Ali             90       34       12    136  128.000000
Ahmed           67       25       56    148  110.666667
Junaid          34       61       78    173  121.000000
Raza            56       37       34    127  104.333333
Asim            78       78       56    212  174.666667
Danish          89       93       12    194  186.000000
Hamza           67       56       34    157  134.333333
Saad            23       74       42    139  111.000000
Shameer         17       29       56    102   64.666667
Baqar           23       10       78    111   59.000000>

In [75]:
data.describe()

       Ai for EO    python1    Python2       Total     Avarage
count  10.000000  10.000000  10.000000   10.000000   10.000000
mean   54.400000  49.700000  45.800000  149.900000  119.366667
std    28.143284  26.783287  23.484274   35.012537   40.561628
min    17.000000  10.000000  12.000000  102.000000   59.000000
25%    25.750000  30.250000  34.000000  129.250000  105.916667
50%    61.500000  46.500000  49.000000  143.500000  116.000000
75%    75.250000  70.750000  56.000000  169.000000  132.750000
max    90.000000  93.000000  78.000000  212.000000  186.000000

In [76]:
data.head

<bound method NDFrame.head of          Ai for EO  python1  Python2  Total     Avarage
Ali             90       34       12    136  128.000000
Ahmed           67       25       56    148  110.666667
Junaid          34       61       78    173  121.000000
Raza            56       37       34    127  104.333333
Asim            78       78       56    212  174.666667
Danish          89       93       12    194  186.000000
Hamza           67       56       34    157  134.333333
Saad            23       74       42    139  111.000000
Shameer         17       29       56    102   64.666667
Baqar           23       10       78    111   59.000000>

In [77]:
data.head()

        Ai for EO  python1  Python2  Total     Avarage
Ali            90       34       12    136  128.000000
Ahmed          67       25       56    148  110.666667
Junaid         34       61       78    173  121.000000
Raza           56       37       34    127  104.333333
Asim           78       78       56    212  174.666667

In [78]:
data.tail()

         Ai for EO  python1  Python2  Total     Avarage
Danish          89       93       12    194  186.000000
Hamza           67       56       34    157  134.333333
Saad            23       74       42    139  111.000000
Shameer         17       29       56    102   64.666667
Baqar           23       10       78    111   59.000000

In [84]:
import numpy as np
# data["Status"] = np.where(data["Total"] > 200, "pass", "Fail")

# Both ways to perform it.

# data["Status"] = ["Pass" if i > 200 else "Fail" for i in data["Total"]]
data

         Ai for EO  python1  Python2  Total     Avarage Status
Ali             90       34       12    136  128.000000   Fail
Ahmed           67       25       56    148  110.666667   Fail
Junaid          34       61       78    173  121.000000   Fail
Raza            56       37       34    127  104.333333   Fail
Asim            78       78       56    212  174.666667   Pass
Danish          89       93       12    194  186.000000   Fail
Hamza           67       56       34    157  134.333333   Fail
Saad            23       74       42    139  111.000000   Fail
Shameer         17       29       56    102   64.666667   Fail
Baqar           23       10       78    111   59.000000   Fail

In [90]:
data["Status"] = np.where(data["Ai for EO] > 33, "pass", "Fail")
data

         Ai for EO  python1  Python2  Total     Avarage Status
Ali             90       34       12    136  128.000000   pass
Ahmed           67       25       56    148  110.666667   pass
Junaid          34       61       78    173  121.000000   pass
Raza            56       37       34    127  104.333333   pass
Asim            78       78       56    212  174.666667   pass
Danish          89       93       12    194  186.000000   pass
Hamza           67       56       34    157  134.333333   pass
Saad            23       74       42    139  111.000000   Fail
Shameer         17       29       56    102   64.666667   Fail
Baqar           23       10       78    111   59.000000   Fail

In [97]:
data["Status"] = ["Pass" if i > 33 else "Fail" for i in data["Ai for EO" and "python1" and "Python2"]]
data

         Ai for EO  python1  Python2  Total     Avarage Status
Ali             90       34       12    136  128.000000   Fail
Ahmed           67       25       56    148  110.666667   Pass
Junaid          34       61       78    173  121.000000   Pass
Raza            56       37       34    127  104.333333   Pass
Asim            78       78       56    212  174.666667   Pass
Danish          89       93       12    194  186.000000   Fail
Hamza           67       56       34    157  134.333333   Pass
Saad            23       74       42    139  111.000000   Pass
Shameer         17       29       56    102   64.666667   Pass
Baqar           23       10       78    111   59.000000   Pass